; domain
(define (domain recharging-robots)
(:requirements :typing :adl :action-costs)
(:types
    location - object
    robot - object
    battery-level - object
    config - object
)

(:predicates
    ;; The remaining battery of the robot
    (battery ?r - robot ?f - battery-level)
    ;; Robot is located at the given location
    (at ?r - robot ?l - location)
    ;; Two locations are connected in the graph of locations
    (CONNECTED ?l1 - location ?l2 - location)
    ;; Robot stopped and is guarding all locations connected to the
    ;; location where robot is located
    (stopped ?r - robot)
    ;; Location ?l is guarded by at least one robot
    (guarded ?l - location)
    ;; ?f1 is predecessor of ?f2 in the battery level, i.e., ?f2 = ?f1 + 1
    (BATTERY-PREDECESSOR ?f1 - battery-level ?f2 - battery-level)
    ;; Definition of a guarding configuration, i.e., one atom per location
    ;; in each configuration
    (GUARD-CONFIG ?c - config ?l - location)
    ;; Configuration is fullfilled, i.e., all of its locations were guarded
    ;; at some point.
    (config-fullfilled ?c - config)
)

(:functions
    (move-cost) - number
    (recharge-cost) - number
    (total-cost) - number
)

;; Move the robot ?r from the location ?from to the location ?to while
;; consuming the battery -- it is decreased by one from ?fpre to ?fpost
(:action move
    :parameters (?r - robot ?from - location ?to - location
                 ?fpre - battery-level ?fpost - battery-level)
    :precondition
        (and
            (not (stopped ?r))
            (at ?r ?from)
            (battery ?r ?fpre)
            (BATTERY-PREDECESSOR ?fpost ?fpre)
            (or (CONNECTED ?from ?to) (CONNECTED ?to ?from))
        )
    :effect
        (and
            (not (at ?r ?from))
            (at ?r ?to)
            (not (battery ?r ?fpre))
            (battery ?r ?fpost)
            (increase (total-cost) (move-cost))
        )
)

;; Recharge robot ?rto at location ?loc by transfering one unit of battery
;; charge from the robot ?rfrom
(:action recharge
    :parameters (?rfrom - robot ?rto - robot ?loc - location
                 ?fpre-from - battery-level ?fpost-from - battery-level
                 ?fpre-to - battery-level ?fpost-to - battery-level)
    :precondition
        (and
            (not (= ?rfrom ?rto))
            (at ?rfrom ?loc)
            (at ?rto ?loc)
            (battery ?rfrom ?fpre-from)
            (battery ?rto ?fpre-to)
            (BATTERY-PREDECESSOR ?fpost-from ?fpre-from)
            (BATTERY-PREDECESSOR ?fpre-to ?fpost-to)
        )
    :effect
        (and
            (not (battery ?rfrom ?fpre-from))
            (battery ?rfrom ?fpost-from)
            (not (battery ?rto ?fpre-to))
            (battery ?rto ?fpost-to)
            (increase (total-cost) (recharge-cost))
        )
)

;; Stop the robot at its current location and guard the neighborhood.
;; Once the robot stopped it can move again only when the configuration is
;; fullfilled, i.e., stopping too early can result in a dead-end.
;; Note that the conditional effect can be compiled away without blow-up,
;; because it is conditioned on a static predicates.
(:action stop-and-guard
    :parameters (?r - robot ?l - location)
    :precondition
        (and
            (not (stopped ?r))
            (at ?r ?l)
        )
    :effect
        (and
            (stopped ?r)
            (guarded ?l)
            (forall (?l2 - location)
                (when (or (CONNECTED ?l ?l2) (CONNECTED ?l2 ?l))
                      (guarded ?l2)
                )
            )
        )
)

;; Verify that the given configuration is fullfilled, i.e., robots guard
;; all locations from the configuration.
;; Note that this action unblocks all robots whether they participate in
;; guarding of the configuration or not. This simplifies the model because
;; otherwise, we would need to keep track of what location is guarded by
;; which robot (it can be guarded by multiple ones).
;; Also note the precondition does not have to inccur exponential blow-up
;; because the imply condition is conditioned on a static predicate.
(:action verify-guard-config
    :parameters (?c - config)
    :precondition
        (and
            (forall (?l - location)
                (imply (GUARD-CONFIG ?c ?l) (guarded ?l))
            )
        )
    :effect
        (and
            (forall (?r - robot) (not (stopped ?r)))
            (forall (?l - location) (not (guarded ?l)))
            (config-fullfilled ?c)
        )
)

)

; problem
;; Genearated with: generator.py single-source-move-to-locations 3 15 22 1.3 problems/m3.pddl problems/m3.plan
;; Random seed: 6129
(define (problem recharge-single-source-move-to-locations-3967)
(:domain recharging-robots)
(:objects
  location-0000 location-0001 location-0002 location-0003 location-0004 location-0005 location-0006 location-0007 location-0008 location-0009 location-0010 location-0011 location-0012 location-0013 location-0014 location-0015 location-0016 location-0017 location-0018 location-0019 location-0020 location-0021 location-0022 location-0023 location-0024 location-0025 location-0026 location-0027 location-0028 location-0029 location-0030 location-0031 location-0032 location-0033 location-0034 location-0035 location-0036 location-0037 location-0038 location-0039 location-0040 location-0041 location-0042 location-0043 location-0044 location-0045 location-0046 location-0047 location-0048 location-0049 location-0050 location-0051 location-0052 location-0053 location-0054 location-0055 location-0056 location-0057 location-0058 location-0059 location-0060 location-0061 location-0062 location-0063 location-0064 location-0065 location-0066 location-0067 location-0068 location-0069 location-0070 location-0071 location-0072 location-0073 location-0074 location-0075 location-0076 location-0077 location-0078 location-0079 location-0080 location-0081 - location
  robot-00 robot-01 robot-02 - robot
  battery-0000 battery-0001 battery-0002 battery-0003 battery-0004 battery-0005 battery-0006 battery-0007 battery-0008 battery-0009 battery-0010 battery-0011 battery-0012 battery-0013 battery-0014 battery-0015 battery-0016 battery-0017 battery-0018 battery-0019 battery-0020 battery-0021 battery-0022 battery-0023 - battery-level
)
(:init
  (= (move-cost) 1)
  (= (recharge-cost) 1)
  (= (total-cost) 0)
  (CONNECTED location-0032 location-0037)
  (CONNECTED location-0072 location-0073)
  (CONNECTED location-0023 location-0068)
  (CONNECTED location-0067 location-0068)
  (CONNECTED location-0030 location-0046)
  (CONNECTED location-0010 location-0043)
  (CONNECTED location-0035 location-0042)
  (CONNECTED location-0044 location-0045)
  (CONNECTED location-0001 location-0040)
  (CONNECTED location-0016 location-0029)
  (CONNECTED location-0070 location-0073)
  (CONNECTED location-0011 location-0051)
  (CONNECTED location-0025 location-0059)
  (CONNECTED location-0014 location-0022)
  (CONNECTED location-0040 location-0041)
  (CONNECTED location-0034 location-0037)
  (CONNECTED location-0066 location-0069)
  (CONNECTED location-0011 location-0078)
  (CONNECTED location-0012 location-0043)
  (CONNECTED location-0003 location-0049)
  (CONNECTED location-0001 location-0079)
  (CONNECTED location-0038 location-0080)
  (CONNECTED location-0016 location-0031)
  (CONNECTED location-0017 location-0060)
  (CONNECTED location-0008 location-0057)
  (CONNECTED location-0047 location-0073)
  (CONNECTED location-0018 location-0037)
  (CONNECTED location-0005 location-0067)
  (CONNECTED location-0029 location-0034)
  (CONNECTED location-0008 location-0011)
  (CONNECTED location-0074 location-0075)
  (CONNECTED location-0066 location-0071)
  (CONNECTED location-0007 location-0058)
  (CONNECTED location-0013 location-0074)
  (CONNECTED location-0047 location-0048)
  (CONNECTED location-0042 location-0043)
  (CONNECTED location-0019 location-0041)
  (CONNECTED location-0000 location-0037)
  (CONNECTED location-0007 location-0030)
  (CONNECTED location-0028 location-0062)
  (CONNECTED location-0014 location-0072)
  (CONNECTED location-0038 location-0039)
  (CONNECTED location-0048 location-0049)
  (CONNECTED location-0000 location-0009)
  (CONNECTED location-0080 location-0081)
  (CONNECTED location-0074 location-0077)
  (CONNECTED location-0048 location-0058)
  (CONNECTED location-0075 location-0076)
  (CONNECTED location-0046 location-0070)
  (CONNECTED location-0004 location-0043)
  (CONNECTED location-0021 location-0059)
  (CONNECTED location-0015 location-0018)
  (CONNECTED location-0071 location-0072)
  (CONNECTED location-0016 location-0017)
  (CONNECTED location-0042 location-0045)
  (CONNECTED location-0022 location-0069)
  (CONNECTED location-0020 location-0081)
  (CONNECTED location-0030 location-0061)
  (CONNECTED location-0020 location-0026)
  (CONNECTED location-0025 location-0047)
  (CONNECTED location-0022 location-0023)
  (CONNECTED location-0005 location-0071)
  (CONNECTED location-0011 location-0057)
  (CONNECTED location-0038 location-0041)
  (CONNECTED location-0006 location-0045)
  (CONNECTED location-0043 location-0064)
  (CONNECTED location-0019 location-0027)
  (CONNECTED location-0055 location-0056)
  (CONNECTED location-0050 location-0051)
  (CONNECTED location-0000 location-0032)
  (CONNECTED location-0053 location-0068)
  (CONNECTED location-0001 location-0039)
  (CONNECTED location-0064 location-0077)
  (CONNECTED location-0008 location-0054)
  (CONNECTED location-0051 location-0052)
  (CONNECTED location-0019 location-0063)
  (CONNECTED location-0046 location-0047)
  (CONNECTED location-0022 location-0025)
  (CONNECTED location-0023 location-0024)
  (CONNECTED location-0078 location-0079)
  (CONNECTED location-0003 location-0030)
  (CONNECTED location-0052 location-0078)
  (CONNECTED location-0026 location-0059)
  (CONNECTED location-0036 location-0045)
  (CONNECTED location-0079 location-0080)
  (CONNECTED location-0024 location-0025)
  (CONNECTED location-0019 location-0038)
  (CONNECTED location-0056 location-0057)
  (CONNECTED location-0017 location-0059)
  (CONNECTED location-0047 location-0072)
  (CONNECTED location-0051 location-0054)
  (CONNECTED location-0011 location-0052)
  (CONNECTED location-0005 location-0066)
  (CONNECTED location-0020 location-0021)
  (CONNECTED location-0046 location-0049)
  (CONNECTED location-0052 location-0053)
  (CONNECTED location-0078 location-0081)
  (CONNECTED location-0007 location-0048)
  (CONNECTED location-0027 location-0081)
  (CONNECTED location-0043 location-0077)
  (CONNECTED location-0016 location-0060)
  (CONNECTED location-0002 location-0006)
  (CONNECTED location-0000 location-0018)
  (CONNECTED location-0030 location-0031)
  (CONNECTED location-0031 location-0060)
  (CONNECTED location-0057 location-0079)
  (CONNECTED location-0063 location-0074)
  (CONNECTED location-0005 location-0050)
  (CONNECTED location-0006 location-0015)
  (CONNECTED location-0032 location-0034)
  (CONNECTED location-0020 location-0078)
  (CONNECTED location-0003 location-0007)
  (CONNECTED location-0026 location-0027)
  (CONNECTED location-0015 location-0036)
  (CONNECTED location-0029 location-0035)
  (CONNECTED location-0031 location-0032)
  (CONNECTED location-0050 location-0067)
  (CONNECTED location-0015 location-0045)
  (CONNECTED location-0014 location-0025)
  (CONNECTED location-0001 location-0055)
  (CONNECTED location-0010 location-0012)
  (CONNECTED location-0027 location-0028)
  (CONNECTED location-0010 location-0076)
  (CONNECTED location-0013 location-0075)
  (CONNECTED location-0054 location-0055)
  (CONNECTED location-0020 location-0053)
  (CONNECTED location-0009 location-0032)
  (CONNECTED location-0003 location-0046)
  (CONNECTED location-0064 location-0065)
  (CONNECTED location-0030 location-0033)
  (CONNECTED location-0022 location-0068)
  (CONNECTED location-0026 location-0029)
  (CONNECTED location-0060 location-0061)
  (CONNECTED location-0021 location-0024)
  (CONNECTED location-0013 location-0041)
  (CONNECTED location-0006 location-0044)
  (CONNECTED location-0024 location-0059)
  (CONNECTED location-0025 location-0058)
  (CONNECTED location-0004 location-0035)
  (CONNECTED location-0019 location-0081)
  (CONNECTED location-0002 location-0010)
  (CONNECTED location-0007 location-0061)
  (CONNECTED location-0036 location-0042)
  (CONNECTED location-0017 location-0029)
  (CONNECTED location-0028 location-0029)
  (CONNECTED location-0001 location-0075)
  (CONNECTED location-0054 location-0057)
  (CONNECTED location-0038 location-0079)
  (CONNECTED location-0050 location-0053)
  (CONNECTED location-0004 location-0065)
  (CONNECTED location-0021 location-0026)
  (CONNECTED location-0018 location-0036)
  (CONNECTED location-0043 location-0065)
  (CONNECTED location-0004 location-0028)
  (CONNECTED location-0000 location-0015)
  (CONNECTED location-0002 location-0012)
  (CONNECTED location-0011 location-0079)
  (CONNECTED location-0012 location-0044)
  (CONNECTED location-0062 location-0063)
  (CONNECTED location-0023 location-0053)
  (CONNECTED location-0058 location-0059)
  (CONNECTED location-0022 location-0072)
  (CONNECTED location-0035 location-0036)
  (CONNECTED location-0027 location-0062)
  (CONNECTED location-0013 location-0063)
  (CONNECTED location-0036 location-0037)
  (CONNECTED location-0066 location-0072)
  (CONNECTED location-0068 location-0069)
  (CONNECTED location-0062 location-0065)
  (CONNECTED location-0063 location-0064)
  (CONNECTED location-0004 location-0042)
  (CONNECTED location-0032 location-0033)
  (CONNECTED location-0058 location-0061)
  (CONNECTED location-0059 location-0060)
  (CONNECTED location-0064 location-0074)
  (CONNECTED location-0008 location-0051)
  (CONNECTED location-0016 location-0034)
  (CONNECTED location-0041 location-0063)
  (CONNECTED location-0002 location-0044)
  (CONNECTED location-0056 location-0079)
  (CONNECTED location-0007 location-0049)
  (CONNECTED location-0031 location-0034)
  (CONNECTED location-0017 location-0026)
  (CONNECTED location-0020 location-0052)
  (CONNECTED location-0028 location-0035)
  (CONNECTED location-0031 location-0061)
  (CONNECTED location-0005 location-0051)
  (CONNECTED location-0043 location-0044)
  (CONNECTED location-0001 location-0038)
  (CONNECTED location-0021 location-0023)
  (CONNECTED location-0069 location-0072)
  (CONNECTED location-0013 location-0040)
  (CONNECTED location-0070 location-0071)
  (CONNECTED location-0050 location-0068)
  (CONNECTED location-0028 location-0065)
  (CONNECTED location-0019 location-0062)
  (CONNECTED location-0020 location-0027)
  (CONNECTED location-0001 location-0056)
  (CONNECTED location-0025 location-0048)
  (CONNECTED location-0039 location-0040)
  (CONNECTED location-0034 location-0035)
  (CONNECTED location-0066 location-0067)
  (CONNECTED location-0019 location-0080)
  (CONNECTED location-0010 location-0077)
  (CONNECTED location-0076 location-0077)
  (CONNECTED location-0046 location-0073)
  (CONNECTED location-0021 location-0053)
  (CONNECTED location-0009 location-0033)
  (CONNECTED location-0014 location-0047)
  (CONNECTED location-0040 location-0075)

  (BATTERY-PREDECESSOR battery-0000 battery-0001)
  (BATTERY-PREDECESSOR battery-0001 battery-0002)
  (BATTERY-PREDECESSOR battery-0002 battery-0003)
  (BATTERY-PREDECESSOR battery-0003 battery-0004)
  (BATTERY-PREDECESSOR battery-0004 battery-0005)
  (BATTERY-PREDECESSOR battery-0005 battery-0006)
  (BATTERY-PREDECESSOR battery-0006 battery-0007)
  (BATTERY-PREDECESSOR battery-0007 battery-0008)
  (BATTERY-PREDECESSOR battery-0008 battery-0009)
  (BATTERY-PREDECESSOR battery-0009 battery-0010)
  (BATTERY-PREDECESSOR battery-0010 battery-0011)
  (BATTERY-PREDECESSOR battery-0011 battery-0012)
  (BATTERY-PREDECESSOR battery-0012 battery-0013)
  (BATTERY-PREDECESSOR battery-0013 battery-0014)
  (BATTERY-PREDECESSOR battery-0014 battery-0015)
  (BATTERY-PREDECESSOR battery-0015 battery-0016)
  (BATTERY-PREDECESSOR battery-0016 battery-0017)
  (BATTERY-PREDECESSOR battery-0017 battery-0018)
  (BATTERY-PREDECESSOR battery-0018 battery-0019)
  (BATTERY-PREDECESSOR battery-0019 battery-0020)
  (BATTERY-PREDECESSOR battery-0020 battery-0021)
  (BATTERY-PREDECESSOR battery-0021 battery-0022)
  (BATTERY-PREDECESSOR battery-0022 battery-0023)

  (at robot-00 location-0035)
  (battery robot-00 battery-0009)
  (at robot-01 location-0035)
  (battery robot-01 battery-0004)
  (at robot-02 location-0035)
  (battery robot-02 battery-0010)

)
(:goal
  (and
    (at robot-00 location-0066)
    (at robot-01 location-0050)
    (at robot-02 location-0022)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (recharge robot-00 robot-01 location-0035 battery-0009 battery-0008 battery-0004 battery-0005)
   deleted: (battery robot-00 battery-0009) (battery robot-01 battery-0004)
   added: (battery robot-00 battery-0008) (battery robot-01 battery-0005)
   goals met: 0 of 3
2. (recharge robot-02 robot-01 location-0035 battery-0010 battery-0009 battery-0005 battery-0006)
   deleted: (battery robot-02 battery-0010) (battery robot-01 battery-0005)
   added: (battery robot-02 battery-0009) (battery robot-01 battery-0006)
   goals met: 0 of 3
3. (move robot-00 location-0035 location-0029 battery-0008 battery-0007)
   deleted: (at robot-00 location-0035) (battery robot-00 battery-0008)
   added: (at robot-00 location-0029) (battery robot-00 battery-0007)
   goals met: 0 of 3
4. (move robot-00 location-0029 location-0026 battery-0007 battery-0006)
   deleted: (at robot-00 location-0029) (battery robot-00 battery-0007)
   added: (at robot-00 location-0026) (battery robot-00 battery-0006)
   goals met: 0 of 3
5. (move robot-00 location-0026 location-0020 battery-0006 battery-0005)
   deleted: (at robot-00 location-0026) (battery robot-00 battery-0006)
   added: (at robot-00 location-0020) (battery robot-00 battery-0005)
   goals met: 0 of 3
6. (move robot-00 location-0020 location-0053 battery-0005 battery-0004)
   deleted: (at robot-00 location-0020) (battery robot-00 battery-0005)
   added: (at robot-00 location-0053) (battery robot-00 battery-0004)
   goals met: 0 of 3
7. (move robot-00 location-0053 location-0068 battery-0004 battery-0003)
   deleted: (at robot-00 location-0053) (battery robot-00 battery-0004)
   added: (at robot-00 location-0068) (battery robot-00 battery-0003)
   goals met: 0 of 3
8. (move robot-00 location-0068 location-0067 battery-0003 battery-0002)
   deleted: (at robot-00 location-0068) (battery robot-00 battery-0003)
   added: (at robot-00 location-0067) (battery robot-00 battery-0002)
   goals met: 0 of 3
9. (move robot-00 location-0067 location-0066 battery-0002 battery-0001)
   deleted: (at robot-00 location-0067) (battery robot-00 battery-0002)
   added: (at robot-00 location-0066) (battery robot-00 battery-0001)
   goals met: 1 of 3
10. (move robot-01 location-0035 location-0029 battery-0006 battery-0005)
   deleted: (at robot-01 location-0035) (battery robot-01 battery-0006)
   added: (at robot-01 location-0029) (battery robot-01 battery-0005)
   goals met: 1 of 3
11. (move robot-01 location-0029 location-0026 battery-0005 battery-0004)
   deleted: (at robot-01 location-0029) (battery robot-01 battery-0005)
   added: (at robot-01 location-0026) (battery robot-01 battery-0004)
   goals met: 1 of 3
12. (move robot-01 location-0026 location-0020 battery-0004 battery-0003)
   deleted: (at robot-01 location-0026) (battery robot-01 battery-0004)
   added: (at robot-01 location-0020) (battery robot-01 battery-0003)
   goals met: 1 of 3
13. (move robot-01 location-0020 location-0053 battery-0003 battery-0002)
   deleted: (at robot-01 location-0020) (battery robot-01 battery-0003)
   added: (at robot-01 location-0053) (battery robot-01 battery-0002)
   goals met: 1 of 3
14. (move robot-01 location-0053 location-0050 battery-0002 battery-0001)
   deleted: (at robot-01 location-0053) (battery robot-01 battery-0002)
   added: (at robot-01 location-0050) (battery robot-01 battery-0001)
   goals met: 2 of 3
15. (move robot-02 location-0035 location-0029 battery-0009 battery-0008)
   deleted: (at robot-02 location-0035) (battery robot-02 battery-0009)
   added: (at robot-02 location-0029) (battery robot-02 battery-0008)
   goals met: 2 of 3
16. (move robot-02 location-0029 location-0026 battery-0008 battery-0007)
   deleted: (at robot-02 location-0029) (battery robot-02 battery-0008)
   added: (at robot-02 location-0026) (battery robot-02 battery-0007)
   goals met: 2 of 3
17. (move robot-02 location-0026 location-0059 battery-0007 battery-0006)
   deleted: (at robot-02 location-0026) (battery robot-02 battery-0007)
   added: (at robot-02 location-0059) (battery robot-02 battery-0006)
   goals met: 2 of 3
18. (move robot-02 location-0059 location-0025 battery-0006 battery-0005)
   deleted: (at robot-02 location-0059) (battery robot-02 battery-0006)
   added: (at robot-02 location-0025) (battery robot-02 battery-0005)
   goals met: 2 of 3
19. (move robot-02 location-0025 location-0022 battery-0005 battery-0004)
   deleted: (at robot-02 location-0025) (battery robot-02 battery-0005)
   added: (at robot-02 location-0022) (battery robot-02 battery-0004)
   goals met: 3 of 3
